===
min jinja
===

{{ config(required_tests='None') }}
select * from {{ ref('table') }}

---

(source_file
  (jinja_block
    (jinja_expr
      (jinja_fn_call
        (jinja_identifier)
        (jinja_argument_list
          (jinja_kwarg
            (jinja_identifier)
            (jinja_expr
              (jinja_lit_string)))))))
  (sql_select_statement
    (sql_select_clause
      (sql_column_list))
    (sql_from_clause
      (jinja_block
        (jinja_expr
          (jinja_fn_call
            (jinja_identifier)
            (jinja_argument_list
              (jinja_expr
                (jinja_lit_string)))))))))

===
min sql casing
===

SELECT * From table

---

(source_file
  (sql_select_statement
    (sql_select_clause
      (sql_column_list))
    (sql_from_clause
      (sql_table_name (sql_identifier)))))

===
sql min select multiple from tables
===

select * from t1, t2

---

(source_file
  (sql_select_statement
    (sql_select_clause
      (sql_column_list))
    (sql_from_clause
      (sql_table_name
        (sql_identifier))
      (sql_table_name
        (sql_identifier)))))

===
sql min select table alias
===

select * from t1 as t

---

(source_file
  (sql_select_statement
    (sql_select_clause
      (sql_column_list))
    (sql_from_clause
      (sql_table_name
        (sql_identifier)
        (sql_identifier)))))

===
sql min select fn
===

select min(1) as c

---

(source_file
  (sql_select_statement
    (sql_select_clause
      (sql_column_list
        (sql_expr
          (sql_alias
            (sql_expr
              (sql_fn
                (sql_identifier)
                (sql_arg_list
                  (sql_expr
                    (sql_identifier)))))
            (sql_identifier)))))))

===
sql min select where clause 
===

select * from a
where a = 'a'

---

(source_file
  (sql_select_statement
    (sql_select_clause
      (sql_column_list))
    (sql_from_clause
      (sql_table_name
        (sql_identifier)))
    (sql_where_clause
      (sql_expr
        (sql_binary_expression
          (sql_expr
            (sql_identifier))
          (sql_expr
            (sql_string
              (content))))))))
